ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/ICSSM_RAT_SLICE1_48009000h.xml
<module name="RAT_SLICE1" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="RAT_SLICE1_PID" acronym="RAT_SLICE1_PID" offset="0" width="32" description="The Revision Register contains the major and minor revisions for the module.">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID register scheme" range="31:30" rwaccess="R"/>
	<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Business Unit: 10 = Processors" range="29:28" rwaccess="R"/>
	<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x1664" description="Module ID" range="27:16" rwaccess="R"/>
	<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x6" description="RTL revision. Will vary depending on release." range="15:11" rwaccess="R"/>
	<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x1" description="Major revision" range="10:8" rwaccess="R"/>
	<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7:6" rwaccess="R"/>
	<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x0" description="Minor revision" range="5:0" rwaccess="R"/>
	</register><register id="RAT_SLICE1_CONFIG" acronym="RAT_SLICE1_CONFIG" offset="4" width="32" description="The Config Register contains the configuration values for the module.">
		<bitfield id="ADDR_WIDTH" width="8" begin="23" end="16" resetval="0x36" description="Number of address bits" range="23:16" rwaccess="R"/>
	<bitfield id="ADDRS" width="8" begin="15" end="8" resetval="0x1" description="Number of addresses" range="15:8" rwaccess="R"/>
	<bitfield id="REGIONS" width="8" begin="7" end="0" resetval="0x6" description="Number of regions" range="7:0" rwaccess="R"/>
	</register><register id="RAT_SLICE1_DESTINATION_ID" acronym="RAT_SLICE1_DESTINATION_ID" offset="2052" width="32" description="The Destination ID Register defines the destination ID value for error messages.">
		<bitfield id="DEST_ID" width="8" begin="7" end="0" resetval="0x0" description="The destination ID." range="7:0" rwaccess="R/W"/>
	</register><register id="RAT_SLICE1_EXCEPTION_LOGGING_CONTROL" acronym="RAT_SLICE1_EXCEPTION_LOGGING_CONTROL" offset="2080" width="32" description="The Exception Logging Control Register controls the exception logging.">
		<bitfield id="DISABLE_INTR" width="1" begin="1" end="1" resetval="0x0" description="Disables logging interrupt when set." range="1" rwaccess="R/W"/>
	<bitfield id="DISABLE_F" width="1" begin="0" end="0" resetval="0x0" description="Disables logging when set." range="0" rwaccess="R/W"/>
	</register><register id="RAT_SLICE1_EXCEPTION_LOGGING_HEADER0" acronym="RAT_SLICE1_EXCEPTION_LOGGING_HEADER0" offset="2084" width="32" description="The Exception Logging Header 0 Register contains the first word of the header.">
		<bitfield id="TYPE_F" width="8" begin="31" end="24" resetval="0x0" description="Type. 4 = RAT." range="31:24" rwaccess="R"/>
	<bitfield id="SRC_ID" width="16" begin="23" end="8" resetval="0x0" description="Source ID." range="23:8" rwaccess="R"/>
	<bitfield id="DEST_ID" width="8" begin="7" end="0" resetval="0x0" description="Destination ID." range="7:0" rwaccess="R"/>
	</register><register id="RAT_SLICE1_EXCEPTION_LOGGING_HEADER1" acronym="RAT_SLICE1_EXCEPTION_LOGGING_HEADER1" offset="2088" width="32" description="The Exception Logging Header 1 Register contains the second word of the header.">
		<bitfield id="GROUP" width="8" begin="31" end="24" resetval="0x0" description="Group." range="31:24" rwaccess="R"/>
	<bitfield id="CODE" width="8" begin="23" end="16" resetval="0x0" description="Code. 1 = Boundary crossing error." range="23:16" rwaccess="R"/>
	</register><register id="RAT_SLICE1_EXCEPTION_LOGGING_DATA0" acronym="RAT_SLICE1_EXCEPTION_LOGGING_DATA0" offset="2092" width="32" description="The Exception Logging Data 0 Register contains the first word of the data.">
		<bitfield id="ADDR_L" width="32" begin="31" end="0" resetval="0x0" description="Address lower 32 bits." range="31:0" rwaccess="R"/>
	</register><register id="RAT_SLICE1_EXCEPTION_LOGGING_DATA1" acronym="RAT_SLICE1_EXCEPTION_LOGGING_DATA1" offset="2096" width="32" description="The Exception Logging Data 1 Register contains the second word of the data.">
		<bitfield id="ADDR_H" width="16" begin="15" end="0" resetval="0x0" description="Address upper 12 bits." range="15:0" rwaccess="R"/>
	</register><register id="RAT_SLICE1_EXCEPTION_LOGGING_DATA2" acronym="RAT_SLICE1_EXCEPTION_LOGGING_DATA2" offset="2100" width="32" description="The Exception Logging Data 2 Register contains the third word of the data.">
		<bitfield id="ROUTEID" width="12" begin="27" end="16" resetval="0x0" description="Route ID." range="27:16" rwaccess="R"/>
	<bitfield id="WRITE" width="1" begin="13" end="13" resetval="0x0" description="Write." range="13" rwaccess="R"/>
	<bitfield id="READ" width="1" begin="12" end="12" resetval="0x0" description="Read." range="12" rwaccess="R"/>
	<bitfield id="DEBUG" width="1" begin="11" end="11" resetval="0x0" description="Debug." range="11" rwaccess="R"/>
	<bitfield id="CACHEABLE" width="1" begin="10" end="10" resetval="0x0" description="Cacheable." range="10" rwaccess="R"/>
	<bitfield id="PRIV" width="1" begin="9" end="9" resetval="0x0" description="Priv." range="9" rwaccess="R"/>
	<bitfield id="SECURE" width="1" begin="8" end="8" resetval="0x0" description="Secure." range="8" rwaccess="R"/>
	<bitfield id="PRIV_ID" width="8" begin="7" end="0" resetval="0x0" description="Priv ID." range="7:0" rwaccess="R"/>
	</register><register id="RAT_SLICE1_EXCEPTION_LOGGING_DATA3" acronym="RAT_SLICE1_EXCEPTION_LOGGING_DATA3" offset="2104" width="32" description="The Exception Logging Data 3 Register contains the fourth word of the data. Reading this register will clear the error pending bit.">
		<bitfield id="BYTECNT" width="10" begin="9" end="0" resetval="0x0" description="Byte count." range="9:0" rwaccess="R"/>
	</register><register id="RAT_SLICE1_EXCEPTION_PEND_SET" acronym="RAT_SLICE1_EXCEPTION_PEND_SET" offset="2112" width="32" description="The Exception Logging Interrupt Pending Set Register allows to set the pend signal.">
		<bitfield id="PEND_SET" width="1" begin="0" end="0" resetval="0x0" description="Write a 1 to set the exception pend signal." range="0" rwaccess="R/W1TS"/>
	</register><register id="RAT_SLICE1_EXCEPTION_PEND_CLEAR" acronym="RAT_SLICE1_EXCEPTION_PEND_CLEAR" offset="2116" width="32" description="The Exception Logging Interrupt Pending Clear Register allows to clear the pend signal.">
		<bitfield id="PEND_CLR" width="1" begin="0" end="0" resetval="0x0" description="Write a 1 to clear the exception pend signal." range="0" rwaccess="R/W1TC"/>
	</register><register id="RAT_SLICE1_EXCEPTION_ENABLE_SET" acronym="RAT_SLICE1_EXCEPTION_ENABLE_SET" offset="2120" width="32" description="The Exception Logging Interrupt Enable Set Register allows to set the interrupt enable signal.">
		<bitfield id="ENABLE_SET" width="1" begin="0" end="0" resetval="0x0" description="Write a 1 to set the exception interrupt enable signal." range="0" rwaccess="R/W1TS"/>
	</register><register id="RAT_SLICE1_EXCEPTION_ENABLE_CLEAR" acronym="RAT_SLICE1_EXCEPTION_ENABLE_CLEAR" offset="2124" width="32" description="The Exception Logging Interrupt Enable Clear Register allows to clear the interrupt enable signal.">
		<bitfield id="ENABLE_CLR" width="1" begin="0" end="0" resetval="0x0" description="Write a 1 to clear the exception interrupt enable signal." range="0" rwaccess="R/W1TC"/>
	</register><register id="RAT_SLICE1_EOI_REG" acronym="RAT_SLICE1_EOI_REG" offset="2128" width="32" description="EOI Register.">
		<bitfield id="EOI_WR" width="16" begin="15" end="0" resetval="0x0" description="EOI Register" range="15:0" rwaccess="R/W"/>
	</register><register id="RAT_SLICE1_REGION_CTRL_j" acronym="RAT_SLICE1_REGION_CTRL_j" offset="32" width="32" description="The Control for Region a">
		<bitfield id="EN" width="1" begin="31" end="31" resetval="0x0" description="Enable for the Region" range="31" rwaccess="R/W"/>
	<bitfield id="SIZE" width="6" begin="5" end="0" resetval="0x0" description="Size of the Region in Address Bits. 0 = 1 byte, 1 = 2B, 2 = 4B, 3 = 8B, etc. up to 32 = 4GB." range="5:0" rwaccess="R/W"/>
	</register><register id="RAT_SLICE1_REGION_BASE_j" acronym="RAT_SLICE1_REGION_BASE_j" offset="36" width="32" description="The Base Address for Region a. This is the source address for matching to a region.">
		<bitfield id="BASE" width="32" begin="31" end="0" resetval="0x0" description="Base Address for the Region. It must be aligned to the programmed size." range="31:0" rwaccess="R/W"/>
	</register><register id="RAT_SLICE1_REGION_TRANS_L_j" acronym="RAT_SLICE1_REGION_TRANS_L_j" offset="40" width="32" description="The Translated Lower Address Bits for Region a">
		<bitfield id="LOWER" width="32" begin="31" end="0" resetval="0x0" description="Translated Lower Address Bits for the Region. It must be aligned to the programmed size." range="31:0" rwaccess="R/W"/>
	</register><register id="RAT_SLICE1_REGION_TRANS_U_j" acronym="RAT_SLICE1_REGION_TRANS_U_j" offset="44" width="32" description="The Translated Upper Address Bits for Region a">
		<bitfield id="UPPER" width="4" begin="3" end="0" resetval="0x0" description="Translated Upper Address Bits for the Region" range="3:0" rwaccess="R/W"/>
	</register>
</module>